### -- Casks (Applications) --

# GPU-accelerated cross-platform terminal emulator
cask "kitty"
# Secure introspectable tunnels to localhost
cask "ngrok"
# Anthropic's Claude Code CLI
cask "claude-code"
# OpenAI Codex CLI
cask "codex"


### -- Performance Monitoring --
# System resource monitors: CPU, memory, disk, network, GPU monitoring tools
#   - bandwhich: https://github.com/imsnif/bandwhich (network bandwidth monitor by process)
#   - bottom:    https://github.com/ClementTsang/bottom
#   - glances:   https://github.com/nicolargo/glances (30k+ stars, web interface support)
#   - btop:      https://github.com/aristocratos/btop (modern alternative with beautiful UI)
#   - htop:      https://github.com/htop-dev/htop
#   - nvtop:     https://github.com/Syllo/nvtop (GPU monitoring for AMD/Intel/NVIDIA/Apple)

# Cross-platform graphical process/system monitor
brew "bottom"


### -- System Utilities --

# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Command-line snippet manager
brew "pet"
# Magical shell history
brew "atuin"


### -- Editors and Code Formatters --

# Version manager for Neovim (https://github.com/MordechaiHadad/bob)
brew "bob"
# Tree-sitter CLI (required by nvim-treesitter for auto_install)
brew "tree-sitter-cli"
# Shell script formatter with configurable style (shfmt)
brew "shfmt"
# Shell script static analysis tool to detect bugs and style issues (shellcheck)
brew "shellcheck"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Dockerfile formatter and parser, a modern dockfmt
brew "dockerfmt"
# Dockerfile linter for best practices and common mistakes
brew "hadolint"
# YAML linter to validate syntax and enforce style guidelines
brew "yamllint"
# GitHub Actions workflow configuration linter
brew "actionlint"


### -- Search and Parsing Tools --

# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"


### -- Git Utilities --

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Text interface for Git repositories
brew "tig"


### -- Security Tools --

# Vulnerability scanner for container images, file systems, and Git repositories
brew "trivy"
# Detect and prevent secrets leaks in git repositories
brew "gitleaks"


### -- Languages & Toolchains --

# Node.js: JavaScript runtime and npm package manager
brew "node"

# Python: Version management
brew "pyenv"
# Python: An extremely fast Python package and project manager, written in Rust
brew "uv"


### -- Testing Tools --

# HTTP load testing tool and library
brew "vegeta"

# Bash Automated Testing System (bats-core plugins)
brew "bats-core/bats-core/bats-assert", link: false
brew "bats-core/bats-core/bats-detik"
brew "bats-core/bats-core/bats-file", link: false
brew "bats-core/bats-core/bats-support", link: false


# vim: ft=ruby
