### -- Tap Repositories --

# Tap repositories
tap "bats-core/bats-core"

### -- System Utilities --

# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"

### -- Editors and Code Formatters --

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Prettier daemon
brew "prettierd"
# Autoformat shell script source code
brew "shfmt"
# Dockerfile format and parser. a modern dockfmt
brew "dockerfmt"

### -- Search and Parsing Tools --

# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"

### -- Git Utilities --

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Text interface for Git repositories
brew "tig"

### -- Python Tools --

# Python version management
brew "pyenv"

### -- Load Testing Tools --

# HTTP load testing tool and library
brew "vegeta"

### -- Testing Tools (Bats-core plugins) --

# Bash Automated Testing System (bats-core plugins)
brew "bats-core/bats-core/bats-assert", link: false
brew "bats-core/bats-core/bats-detik"
brew "bats-core/bats-core/bats-file", link: false
brew "bats-core/bats-core/bats-support", link: false
