### -- Casks (Applications) --

# GPU-accelerated cross-platform terminal emulator
cask "kitty"
# Secure introspectable tunnels to localhost
cask "ngrok"


### -- Performance Monitoring --
# System resource monitors: CPU, memory, disk, network, GPU monitoring tools
#   - bandwhich: https://github.com/imsnif/bandwhich (network bandwidth monitor by process)
#   - bottom:    https://github.com/ClementTsang/bottom
#   - glances:   https://github.com/nicolargo/glances (30k+ stars, web interface support)
#   - btop:      https://github.com/aristocratos/btop (modern alternative with beautiful UI)
#   - htop:      https://github.com/htop-dev/htop
#   - nvtop:     https://github.com/Syllo/nvtop (GPU monitoring for AMD/Intel/NVIDIA/Apple)

# Cross-platform graphical process/system monitor
brew "bottom"


### -- System Utilities --

# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Command-line snippet manager
brew "pet"


### -- Editors and Code Formatters --

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tree-sitter CLI (required by nvim-treesitter for auto_install)
brew "tree-sitter-cli"
# Autoformat shell script source code
brew "shfmt"
# Dockerfile format and parser. a modern dockfmt
brew "dockerfmt"
# TOML toolkit written in Rust
brew "taplo"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"


### -- Search and Parsing Tools --

# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"


### -- Git Utilities --

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Text interface for Git repositories
brew "tig"


### -- Languages & Toolchains --

# Node.js: JavaScript runtime and npm package manager
brew "node"

# Python: Version management
brew "pyenv"


### -- Testing Tools --

# HTTP load testing tool and library
brew "vegeta"

# Bash Automated Testing System (bats-core plugins)
brew "bats-core/bats-core/bats-assert", link: false
brew "bats-core/bats-core/bats-detik"
brew "bats-core/bats-core/bats-file", link: false
brew "bats-core/bats-core/bats-support", link: false
